Show / Hide Table of Contents
Class CheckSectionExtreme
Check section extreme base class
Inheritance
System.Object
CheckSectionExtreme
StagedCheckSectionExtreme
StandardCheckSectionExtreme
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CheckSectionExtreme
Constructors
Improve this Doc   View Source
CheckSectionExtreme()
Constructor
Declaration
protected CheckSectionExtreme()
Properties
Improve this Doc   View Source
Accidental
Accidental loading
Declaration
public LoadingULS Accidental { get; set; }
Property Value
 Type |  Description
 LoadingULS
Improve this Doc   View Source
Fatigue
Quasi-Permanent loading
Declaration
public FatigueLoading Fatigue { get; set; }
Property Value
 Type |  Description
 FatigueLoading
Improve this Doc   View Source
Frequent
Frequent loading
Declaration
public LoadingSLS Frequent { get; set; }
Property Value
 Type |  Description
 LoadingSLS
Improve this Doc   View Source
Fundamental
Fundamental loading
Declaration
public LoadingULS Fundamental { get; set; }
Property Value
 Type |  Description
 LoadingULS
Improve this Doc   View Source
Characteristic
Characterictic loading
Declaration
public LoadingSLS Characteristic { get; set; }
Property Value
 Type |  Description
 LoadingSLS
Improve this Doc   View Source
QuasiPermanent
Quasi-Permanent loading
Declaration
public LoadingSLS QuasiPermanent { get; set; }
Property Value
 Type |  Description
 LoadingSLS
 Improve this Doc
 View Source